STM32VN/STM32F1-Arduino-For-Keil/HARDWARE/STM32Ethernet-master/src/utility/ethernetif.cpp
				ETH_MII_RXD2 ---------------------> PB0/PH6
				ETH_MII_RXD3 ---------------------> PB1/PH7
				ETH_PPS_OUT ----------------------> PB5
				ETH_MII_TXD3 ---------------------> PB8
				
        ETH_MDC --------------------------> PC1
				ETH_MII_TXD2 ---------------------> PC2
				ETH_MII_TX_CLK -------------------> PC3
				ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4
        ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5
				
				ETH_MII_RX_ER --------------------> PB10/PI10   
        ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11/PG11
        ETH_MII_TXD0/ETH_RMII_TXD0 -------> PB12/PG13
        ETH_MII_TXD1/ETH_RMII_TXD1 -------> PB13/PG14
                                                  */
	__HAL_RCC_AFIO_CLK_ENABLE();
	
  /* Configure PA1, PA2 , PA7 */
  GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;//GPIO_PIN_3 |GPIO_PIN_0 |
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull = GPIO_NOPULL; 
  //GPIO_InitStructure.Alternate = GPIO_AF11_ETH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Configure PB11 P12 and PB13 */
  GPIO_InitStructure.Pin = GPIO_PIN_11 | GPIO_PIN_12| GPIO_PIN_13;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* Configure PC1, PC2, PC3, PC4 and PC5 */
  GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5;// GPIO_PIN_2 | GPIO_PIN_3 |
  HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);
                             
//  /* Configure PG11, PG14 and PG13 */
//  GPIO_InitStructure.Pin =  GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14;
//  HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

//  /* Configure PH2, PH3, PH6, PH7 */
//  GPIO_InitStructure.Pin = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_6 | GPIO_PIN_7;
//  HAL_GPIO_Init(GPIOH, &GPIO_InitStructure);

//  /* Configure PI10 */
//  GPIO_InitStructure.Pin = GPIO_PIN_10;
//  HAL_GPIO_Init(GPIOI, &GPIO_InitStructure);

#ifdef ETH_INPUT_USE_IT
  /* Enable the Ethernet global Interrupt */
  HAL_NVIC_SetPriority(ETH_IRQn, 0x7, 0);
  HAL_NVIC_EnableIRQ(ETH_IRQn);
#endif /* ETH_INPUT_USE_IT */

  /* Enable ETHERNET clock  */
  __HAL_RCC_ETH_CLK_ENABLE();
	
}

/*******************************************************************************
                       LL Driver Interface ( LwIP stack --> ETH)
*******************************************************************************/
/**
  * @brief In this function, the hardware should be initialized.
  * Called from ethernetif_init().
  *
  * @param netif the already initialized lwip network interface structure
  *        for this ethernetif
  */
static void low_level_init(struct netif *netif)
{
  uint32_t regvalue;

  EthHandle.Instance = ETH;
  EthHandle.Init.MACAddr = macaddress;
  EthHandle.Init.AutoNegotiation = ETH_AUTONEGOTIATION_ENABLE;
  EthHandle.Init.Speed = ETH_SPEED_100M;
  EthHandle.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
#ifdef ETHERNET_RMII_MODE_CONFIGURATION
  EthHandle.Init.MediaInterface = ETH_MEDIA_INTERFACE_RMII;
#else
  EthHandle.Init.MediaInterface = ETH_MEDIA_INTERFACE_MII;
#endif /* ETHERNET_RMII_MODE_CONFIGURATION */
#ifdef ETH_INPUT_USE_IT
  EthHandle.Init.RxMode = ETH_RXINTERRUPT_MODE;
#else
  EthHandle.Init.RxMode = ETH_RXPOLLING_MODE;
#endif /* ETH_INPUT_USE_IT */
  EthHandle.Init.ChecksumMode = ETH_CHECKSUM_BY_HARDWARE;
	
#if LAN87xx
  EthHandle.Init.PhyAddress = LAN8742A_PHY_ADDRESS;//DP83848_PHY_ADDRESS ;//LAN8742A_PHY_ADDRESS;//////////////////////////
#else 
EthHandle.Init.PhyAddress = DP83848_PHY_ADDRESS ;
#endif
  /* configure ethernet peripheral (GPIOs, clocks, MAC, DMA) */
  if (HAL_ETH_Init(&EthHandle) == HAL_OK)
  {
    /* Set netif link flag */
    netif->flags |= NETIF_FLAG_LINK_UP;//Serial1.println("OK");
  }

  /* Initialize Tx Descriptors list: Chain Mode */
  HAL_ETH_DMATxDescListInit(&EthHandle, DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);

  /* Initialize Rx Descriptors list: Chain Mode  */
  HAL_ETH_DMARxDescListInit(&EthHandle, DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);

  /* set MAC hardware address length */
  netif->hwaddr_len = ETH_HWADDR_LEN;

  /* set MAC hardware address */
  netif->hwaddr[0] =  macaddress[0];
  netif->hwaddr[1] =  macaddress[1];
  netif->hwaddr[2] =  macaddress[2];
  netif->hwaddr[3] =  macaddress[3];
  netif->hwaddr[4] =  macaddress[4];
  netif->hwaddr[5] =  macaddress[5];

  /* maximum transfer unit */
  netif->mtu = 1500;

  /* device capabilities */
	
	/* Accept broadcast address and ARP traffic */
//		/* don't set NETIF_FLAG_ETHARP if this device is not an ethernet one */
//		#if LWIP_ARP
//		netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP;
//		# else 
//		netif->flags |= NETIF_FLAG_BROADCAST;
//		#endif /* LWIP_ARP */

  /* don't set NETIF_FLAG_ETHARP if this device is not an ethernet one */
  netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP;

  /* Enable MAC and DMA transmission and reception */
  HAL_ETH_Start(&EthHandle);
	
	
///////////////////////////////////////////////////////////////////////		
#if LWIP_IGMP
  netif_set_igmp_mac_filter(netif, igmp_mac_filter);
#endif

#if LAN87xx
//////////////////////////////////////////LAN87xx//////////////////////////////////////////	
  /**** Configure PHY to generate an interrupt when Eth Link state changes ****/
  /* Read Register Configuration */
  HAL_ETH_ReadPHYRegister(&EthHandle, PHY_IMR, &regvalue);

  regvalue |= PHY_ISFR_INT4;

  /* Enable Interrupt on change of link status */
  HAL_ETH_WritePHYRegister(&EthHandle, PHY_IMR, regvalue );
#else
/////////////////////////////////DP83848//////////////////////////////////////////////////////////
    /**** Configure PHY to generate an interrupt when Eth Link state changes ****/
    /* Read Register Configuration */
    HAL_ETH_ReadPHYRegister(&EthHandle, PHY_MICR, &regvalue);

    regvalue |= (PHY_MICR_INT_EN | PHY_MICR_INT_OE);

    /* Enable Interrupts */
    HAL_ETH_WritePHYRegister(&EthHandle, PHY_MICR, regvalue);

    /* Read Register Configuration */
    HAL_ETH_ReadPHYRegister(&EthHandle, PHY_MISR, &regvalue);

    regvalue |= PHY_MISR_LINK_INT_EN;

    /* Enable Interrupt on change of link status */
    HAL_ETH_WritePHYRegister(&EthHandle, PHY_MISR, regvalue);
#endif
//////////////////////////////////////////////////////////////////////////
#if LWIP_IGMP
  ETH_HashTableHigh=EthHandle.Instance->MACHTHR;
  ETH_HashTableLow=EthHandle.Instance->MACHTLR;
#endif

